[source::WinEventLog:Microsoft-Windows-Security-Auditing]
EXTRACT-Status = cs4=(?<Status>\S+)
EXTRACT-Logon_Type = Logon Type:\\t\\t\\t(?<Logon_Type>.*?)\\r

[source::WinEventLog:Security]
TIME_PREFIX = ^
TIME_FORMAT = %b %d %H:%M:%S
# MAX_TIMESTAMP_LOOKAHEAD = 22

SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)

[WinEventLog]
TRANSFORMS-source_for_wineventlog = source_for_wineventlog_ms, source_for_wineventlog
TIME_PREFIX = ^
TIME_FORMAT = %b %d %H:%M:%S
# MAX_TIMESTAMP_LOOKAHEAD = 22

SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)
TRUNCATE = 999999

# Extractions
KV_MODE = none
EXTRACT-cef-message = CEF:\d\|(?<vendor>[^\|]+)\|(?<product>[^\|]+)\|(?<product_version>[^\|]+)\|(?<signature_id>[^\|]+)\|(?<signature>[^\|]+)\|(?<vendor_severity>[^\|]+)\|(?<cef_message>.*)
REPORT-cefLabelFirst = cef_wineventlog_security_cefLabelFirst
REPORT-cefLabelSecond = cef_wineventlog_security_cefLabelSecond
REPORT-builtInCefFields = cef_wineventlog_security_builtInCefFields
REPORT-member_id_for_windows_security = Member_ID_as_member_id,Security_ID_as_member_id

# Field aliases for CIM compliance
FIELDALIAS-act = act AS vendor_action
FIELDALIAS-cat = cat AS category
FIELDALIAS-cat = cat AS TaskCategory
FIELDALIAS-dhost = dhost AS dest_host
FIELDALIAS-dhost_nthost = dhost AS dest_nt_host
FIELDALIAS-dmac = dmac AS dest_mac
FIELDALIAS-dntdom = dntdom AS dest_nt_domain
FIELDALIAS-dpid = dpid AS dest_pid
FIELDALIAS-dproc = dproc AS dest_process
FIELDALIAS-dpt = dpt AS dest_port
FIELDALIAS-dst = dst AS dest_ip
FIELDALIAS-duid = duid AS dest_user_id
FIELDALIAS-duser = duser AS dest_user
FIELDALIAS-dvchost = dvchost AS ComputerName
FIELDALIAS-dvcmac = dvcmac AS dvc_mac
FIELDALIAS-deviceNtDomain = deviceNtDomain AS dvc_nt_domain
FIELDALIAS-dvcpid = dvcpid AS dvc_pid
FIELDALIAS-eventId = eventId AS event_id
FIELDALIAS-fileHash = fileHash AS file_hash
FIELDALIAS-filePath = filePath AS file_path
FIELDALIAS-fname = fname AS file_name
FIELDALIAS-fsize = fsize AS file_size
FIELDALIAS-in = in AS bytes_in
FIELDALIAS-msg = msg AS Message
FIELDALIAS-out = out AS bytes_out
FIELDALIAS-outcome = outcome AS vendor_outcome
FIELDALIAS-proto = proto AS protocol
FIELDALIAS-reason = reason AS vendor_reason
FIELDALIAS-request = request AS url
FIELDALIAS-spid = spid AS src_pid
FIELDALIAS-sproc = sproc AS src_process
FIELDALIAS-spt = spt AS src_port
FIELDALIAS-suid = suid AS src_user_id
FIELDALIAS-suser = suser AS src_user
FIELDALIAS-logon_account = Logon_Account AS user
FIELDALIAS-Type = outcome AS Type

FIELDALIAS-eventCode = externalId AS EventCode
EXTRACT-Account_Name = Account Name:\s+(?!-)(?<Account_Name>\S+)
EXTRACT-Logon_Account = Logon Account:\s+(?<Logon_Account>\S+)
EXTRACT-Logon_Type = Logon Type:\s+(?<Logon_Type>\S+)
EXTRACT-Account_Domain = Account Domain:\s+(?!-)(?<Account_Domain>\S+)
EXTRACT-Authentication_Package = Authentication Package:\s+(?!-)(?<Authentication_Package>\S+)
EXTRACT-Key_Length = Key Length:\s+(?!-)(?<Key_Length>\S+)
EXTRACT-Logon_Process = Logon Process:\s+(?!-)(?<Logon_Process>\S+)
EXTRACT-Security_ID = Security ID:\s+(?!-)(?<Security_ID>\S+)
# EXTRACT-src = src=(?<src>\S+)

# Depending on the data, one of these can be used as the dest.
# Check the docs for the data model you are working with to see which.
# FIELDALIAS-dst_dest = dst AS dest
# FIELDALIAS-dhost = dhost AS dest
# NOTE: the field aliases are not needed if you use the following EVALs
# but the FIELDALIASes should have better search performance when searching against that particular field
EVAL-dest = coalesce(dest,dvchost)
EVAL-dvc = coalesce(dvc_host,dvc_ip)
# EVAL-src = coalesce(shost,src,smac)

EVAL-user = coalesce(user,duser)

LOOKUP-action_for_windows0_security = windows_audit_changes_lookup EventCode OUTPUTNEW  action,change_type,object_category
LOOKUP-action_for_windows1_security = windows_action_lookup Type OUTPUTNEW action, action AS status
LOOKUP-action_for_windows2_security = windows_action_lookup Type AS Keywords OUTPUTNEW action, action AS status
BREAK_ONLY_BEFORE_DATE =
DATETIME_CONFIG =
NO_BINARY_CHECK = true
category = Custom
disabled = false
